unfortunately this recreate all projects. e.g.:

```
 # aws_codebuild_project.ubuntu_22_36c will be destroyed
10:12:19.409 STDOUT terraform:   # (because aws_codebuild_project.ubuntu_22_36c is not in configuration)
10:12:19.409 STDOUT terraform:   - resource "aws_codebuild_project" "ubuntu_22_36c" {
10:12:19.409 STDOUT terraform:       - arn                    = "arn:aws:codebuild:us-east-2:442426873467:project/ubuntu-22-36c" -> null
10:12:19.409 STDOUT terraform:       - badge_enabled          = false -> null
10:12:19.409 STDOUT terraform:       - build_timeout          = 360 -> null
10:12:19.409 STDOUT terraform:       - concurrent_build_limit = 0 -> null
10:12:19.409 STDOUT terraform:       - encryption_key         = "arn:aws:kms:us-east-2:442426873467:alias/aws/s3" -> null
10:12:19.409 STDOUT terraform:       - id                     = "arn:aws:codebuild:us-east-2:442426873467:project/ubuntu-22-36c" -> null
10:12:19.409 STDOUT terraform:       - name                   = "ubuntu-22-36c" -> null
10:12:19.410 STDOUT terraform:       - project_visibility     = "PRIVATE" -> null
10:12:19.410 STDOUT terraform:       - queued_timeout         = 480 -> null
10:12:19.410 STDOUT terraform:       - service_role           = "arn:aws:iam::442426873467:role/codebuild-github-runner-role" -> null
10:12:19.410 STDOUT terraform:       - tags                   = {} -> null
10:12:19.410 STDOUT terraform:       - tags_all               = {} -> null
10:12:19.410 STDOUT terraform:       - artifacts {
10:12:19.410 STDOUT terraform:           - encryption_disabled    = false -> null
10:12:19.410 STDOUT terraform:           - override_artifact_name = false -> null
10:12:19.410 STDOUT terraform:           - type                   = "NO_ARTIFACTS" -> null
10:12:19.410 STDOUT terraform:         }
10:12:19.410 STDOUT terraform:       - cache {
10:12:19.410 STDOUT terraform:           - modes = [] -> null
10:12:19.410 STDOUT terraform:           - type  = "NO_CACHE" -> null
10:12:19.411 STDOUT terraform:         }
10:12:19.411 STDOUT terraform:       - environment {
10:12:19.411 STDOUT terraform:           - compute_type                = "BUILD_GENERAL1_XLARGE" -> null
10:12:19.411 STDOUT terraform:           - image                       = "aws/codebuild/standard:7.0-24.10.29" -> null
10:12:19.411 STDOUT terraform:           - image_pull_credentials_type = "CODEBUILD" -> null
10:12:19.411 STDOUT terraform:           - privileged_mode             = true -> null
10:12:19.411 STDOUT terraform:           - type                        = "LINUX_CONTAINER" -> null
10:12:19.411 STDOUT terraform:         }
10:12:19.411 STDOUT terraform:       - logs_config {
10:12:19.411 STDOUT terraform:           - cloudwatch_logs {
10:12:19.411 STDOUT terraform:               - status = "DISABLED" -> null
10:12:19.411 STDOUT terraform:             }
10:12:19.411 STDOUT terraform:           - s3_logs {
10:12:19.411 STDOUT terraform:               - encryption_disabled = false -> null
10:12:19.411 STDOUT terraform:               - status              = "DISABLED" -> null
10:12:19.411 STDOUT terraform:             }
10:12:19.411 STDOUT terraform:         }
10:12:19.411 STDOUT terraform:       - source {
10:12:19.411 STDOUT terraform:           - git_clone_depth     = 1 -> null
10:12:19.411 STDOUT terraform:           - insecure_ssl        = false -> null
10:12:19.411 STDOUT terraform:           - location            = "https://github.com/rust-lang-ci/rust" -> null
10:12:19.411 STDOUT terraform:           - report_build_status = false -> null
10:12:19.411 STDOUT terraform:           - type                = "GITHUB" -> null
10:12:19.411 STDOUT terraform:           - git_submodules_config {
10:12:19.411 STDOUT terraform:               - fetch_submodules = false -> null
10:12:19.411 STDOUT terraform:             }
10:12:19.411 STDOUT terraform:         }
10:12:19.411 STDOUT terraform:     }

10:12:19.415 STDOUT terraform:   # module.ubuntu_22_36c.aws_codebuild_project.ubuntu_project will be created
10:12:19.415 STDOUT terraform:   + resource "aws_codebuild_project" "ubuntu_project" {
10:12:19.415 STDOUT terraform:       + arn                  = (known after apply)
10:12:19.415 STDOUT terraform:       + badge_enabled        = false
10:12:19.415 STDOUT terraform:       + badge_url            = (known after apply)
10:12:19.415 STDOUT terraform:       + build_timeout        = 360
10:12:19.415 STDOUT terraform:       + description          = (known after apply)
10:12:19.415 STDOUT terraform:       + encryption_key       = (known after apply)
10:12:19.415 STDOUT terraform:       + id                   = (known after apply)
10:12:19.415 STDOUT terraform:       + name                 = "ubuntu-22-36c"
10:12:19.415 STDOUT terraform:       + project_visibility   = "PRIVATE"
10:12:19.415 STDOUT terraform:       + public_project_alias = (known after apply)
10:12:19.415 STDOUT terraform:       + queued_timeout       = 480
10:12:19.415 STDOUT terraform:       + service_role         = "arn:aws:iam::442426873467:role/codebuild-github-runner-role"
10:12:19.415 STDOUT terraform:       + tags_all             = (known after apply)
10:12:19.415 STDOUT terraform:       + artifacts {
10:12:19.415 STDOUT terraform:           + encryption_disabled    = false
10:12:19.415 STDOUT terraform:           + override_artifact_name = false
10:12:19.415 STDOUT terraform:           + type                   = "NO_ARTIFACTS"
10:12:19.415 STDOUT terraform:         }
10:12:19.415 STDOUT terraform:       + cache {
10:12:19.415 STDOUT terraform:           + type = "NO_CACHE"
10:12:19.415 STDOUT terraform:         }
10:12:19.415 STDOUT terraform:       + environment {
10:12:19.415 STDOUT terraform:           + compute_type                = "BUILD_GENERAL1_XLARGE"
10:12:19.415 STDOUT terraform:           + image                       = "aws/codebuild/standard:7.0-24.10.29"
10:12:19.416 STDOUT terraform:           + image_pull_credentials_type = "CODEBUILD"
10:12:19.416 STDOUT terraform:           + privileged_mode             = true
10:12:19.416 STDOUT terraform:           + type                        = "LINUX_CONTAINER"
10:12:19.416 STDOUT terraform:         }
10:12:19.416 STDOUT terraform:       + logs_config {
10:12:19.416 STDOUT terraform:           + cloudwatch_logs {
10:12:19.416 STDOUT terraform:               + status = "DISABLED"
10:12:19.416 STDOUT terraform:             }
10:12:19.416 STDOUT terraform:         }
10:12:19.416 STDOUT terraform:       + source {
10:12:19.416 STDOUT terraform:           + git_clone_depth = 1
10:12:19.416 STDOUT terraform:           + location        = "https://github.com/rust-lang-ci/rust"
10:12:19.416 STDOUT terraform:           + type            = "GITHUB"
10:12:19.416 STDOUT terraform:           + git_submodules_config {
10:12:19.416 STDOUT terraform:               + fetch_submodules = false
10:12:19.416 STDOUT terraform:             }
10:12:19.416 STDOUT terraform:         }
10:12:19.416 STDOUT terraform:     }
```